# -*- coding: utf-8 -* 

'''
语言元素

计算机的硬件系统通常由五大部件构成：
包括 运算器、控制器、存储器、输入设备和输出设备

其中，运算器和控制器放在一起就是我们通常说的中央处理器
它的功能是执行各种运算和控制指令 以及 处理计算机软件中的数据

我们通常说的程序就是指令的集合，我们的程序就是将一系列指令按照某种方式组织到一起，
然后通过这些指令去控制计算机做我们想让它做的事情。

附属了解：冯诺依曼结构
冯诺依曼有两个关键点：
1、是指出要将存储设备和中央处理器分开
2、提出了将数据以二进制方式编码

二进制是一种逢二进一的计数法，跟我们平时使用的逢十进一的计数法没有实质性的区别
对于计算机来说，二进制在物理器件上来说是最容易实现的(高电压表示 1，低电压表示 0)
于是在 冯诺依曼结构 的计算机都使用了二进制。

------------------------------------------------------

变量和类型

在程序设计中，变量是一种存储数据的载体。
计算机中的变量是实际存在的数据或者说是存储器中存储数据的一块内存空间，变量的值可以被读取和修改。
这是所有计算和控制的基础。

计算机能处理的数据有很多类型，除了数值之外还可以处理文本、图形、音频、视频等各种各样的数据

整型：支持二进制、八进制、十进制、十六进制的表示法
浮点型：浮点型也就是小数，之所以称为浮点数，是因为按照科学计数法表示时，一个浮点数的小数点位置时可变的
浮点数除了数学写法之外还支持科学计数法

字符串型：字符串是以单引号或者双引号括起来的任意文本，比如 'hello' 和 "
hello" 

布尔值：布尔值只有 true 和 false 两种值，要么是 true 要么是 false
在 python ，可以直接使用 true，false 表示布尔值

复数型：唯一不同的是虚部的 i 换成了 j

变量命名

硬性规定：
1、变量名由字母、数字和下划线构成，数字不能开头
2、大小写敏感
3、不要跟关键字和系统保留字冲突

PEP8 要求：
1、用小写字母拼写，多个单词下用下划线链接
2、受保护的实例属性用单个下划线开头
3、私有的实例属性用两个下划线开头

当然，作为一个专业的程序员，给变量(事实上是所有的标识符)命名时做到见名知意也是非常重要的

'''

# a = 321
# b = 123
# print(a + b)
# print(a - b)
# print(a * b)
# print(a / b)

# print(a // b)
# print(a % b)
# print(a ** b)


'''

使用 input() 函数获取键盘输入
使用 int() 进行类型转换
用占位符格式化输出的字符串

'''

# a = int(input('a = '))
# b = int(input('b = '))
# print('%d + %d = %d' % (a, b, a + b))
# print('%d - %d = %d' % (a, b, a - b))

'''
使用 type() 检查变量的类型

'''

a = 100
b = 12.345
c = 1 + 5j
d = "hello,world"
e = True

print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))

'''
在对变量类型进行转换时可以使用 python 的内置函数

int(): 将一个数值或者字符串转换成整数，可以指定进制
float(): 将一个字符串转换成浮点数
str(): 将指定的对象转换成字符串形式，可以指定编码
chr(): 将整数转换成该编码对应的字符串(一个字符)
ord(): 将字符串(一个字符)转换成对应的编码(整数) 

'''

